In [1]:
import pandas as pd
import seaborn as sns

## Pivot Table

In [2]:
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
# Find Average Bill Paide by Male and Female

sex = df.groupby('sex', observed=True)[['total_bill']].mean()
sex

        total_bill
sex
Male     20.744076
Female   18.056897

In [4]:
# Find Average Bill Paide by Male and Female with smoker and no smoker
sex = df.groupby(['sex','smoker'], observed=True)[['total_bill']].mean().unstack()
sex

       total_bill
smoker        Yes         No
sex
Male    22.284500  19.791237
Female  17.977879  18.105185

In [5]:
# We can do it same using Pivot Table

df.pivot_table(index='sex', columns='smoker', values='total_bill', observed=True)
# by default mean summarize karke deta hai

smoker        Yes         No
sex
Male    22.284500  19.791237
Female  17.977879  18.105185

In [6]:
df.pivot_table(index='sex', columns='smoker', values='total_bill', aggfunc='count', observed=True)

smoker  Yes  No
sex
Male     60  97
Female   33  54

In [7]:
# multidimension

df.pivot_table(index=['sex','smoker'], columns=['day','time'], values='total_bill',observed=True )

day                 Thur               Fri                Sat        Sun
time               Lunch Dinner      Lunch  Dinner     Dinner     Dinner
sex    smoker
Male   Yes     19.171000    NaN  11.386667  25.892  21.837778  26.141333
       No      18.486500    NaN        NaN  17.475  19.929063  20.403256
Female Yes     19.218571    NaN  13.260000  12.200  20.266667  16.540000
       No      15.899167  18.78  15.980000  22.750  19.003846  20.824286

In [8]:
# margins

df.pivot_table(index='sex', columns='smoker', values='total_bill', aggfunc='sum', observed=True, margins=True)

smoker      Yes       No      All
sex
Male    1337.07  1919.75  3256.82
Female   593.27   977.68  1570.95
All     1930.34  2897.43  4827.77

In [9]:
df1 = pd.read_csv('expense_data.csv')
df1.head()

,Date,Account,Category,Subcategory,Note,INR,Income/Expense,Note.1,Amount,Currency,Account.1
0,3/2/2022 10:11,CUB - online payment,Food,NaN,Brownie,50.0,Expense,NaN,50.0,INR,50.0
1,3/2/2022 10:11,CUB - online payment,Other,NaN,To lended people,300.0,Expense,NaN,300.0,INR,300.0
2,3/1/2022 19:50,CUB - online payment,Food,NaN,Dinner,78.0,Expense,NaN,78.0,INR,78.0
3,3/1/2022 18:56,CUB - online payment,Transportation,NaN,Metro,30.0,Expense,NaN,30.0,INR,30.0
4,3/1/2022 18:22,CUB - online payment,Food,NaN,Snacks,67.0,Expense,NaN,67.0,INR,67.0

In [11]:
# DataTime
df1['Date'] = pd.to_datetime(df1['Date'])
df1.head(3)

,Date,Account,Category,Subcategory,Note,INR,Income/Expense,Note.1,Amount,Currency,Account.1
0,2022-03-02 10:11:00,CUB - online payment,Food,NaN,Brownie,50.0,Expense,NaN,50.0,INR,50.0
1,2022-03-02 10:11:00,CUB - online payment,Other,NaN,To lended people,300.0,Expense,NaN,300.0,INR,300.0
2,2022-03-01 19:50:00,CUB - online payment,Food,NaN,Dinner,78.0,Expense,NaN,78.0,INR,78.0

In [12]:
df1['month'] = df1['Date'].dt.month_name()
df1.head(3)

,Date,Account,Category,Subcategory,Note,INR,Income/Expense,Note.1,Amount,Currency,Account.1,month
0,2022-03-02 10:11:00,CUB - online payment,Food,NaN,Brownie,50.0,Expense,NaN,50.0,INR,50.0,March
1,2022-03-02 10:11:00,CUB - online payment,Other,NaN,To lended people,300.0,Expense,NaN,300.0,INR,300.0,March
2,2022-03-01 19:50:00,CUB - online payment,Food,NaN,Dinner,78.0,Expense,NaN,78.0,INR,78.0,March

In [24]:
df1.pivot_table(index='month', columns='Category', values='INR', aggfunc='sum', fill_value= 0)

Category,Allowance,Apparel,Beauty,Education,Food,Gift,Household,Other,Petty cash,Salary,Self-development,Social Life,Transportation
month,,,,,,,,,,,,,
December,11000.0,2590.0,196.0,0.0,6440.72,0.0,4800.0,1790.0,0.0,0.0,400.0,513.72,914.0
February,0.0,798.0,0.0,0.0,5579.85,0.0,2808.0,20000.0,0.0,0.0,0.0,1800.00,5078.8
January,1000.0,0.0,0.0,1400.0,9112.51,0.0,4580.0,13178.0,0.0,8000.0,0.0,200.00,2850.0
March,0.0,0.0,0.0,0.0,195.00,0.0,0.0,900.0,0.0,0.0,0.0,0.00,30.0
November,2000.0,0.0,0.0,0.0,3174.40,115.0,0.0,2000.0,3.0,0.0,0.0,0.00,331.0

## Vectorized String Operations

In [2]:
df = pd.read_csv('titanic.csv')
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [44]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [29]:
# lower upper capitalize title len
df['Name'].str.upper()

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object

In [33]:
df['Name'].str.len()

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name, Length: 891, dtype: int64

In [34]:
df['Name'].str.len().max()

82

In [45]:
df['Name'][df['Name'].str.len()==82].values[0]

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'

In [47]:
# strip means remove leading and trailing spaces

'        Owais       '.strip()

'Owais'

In [48]:
df['Name'].str.strip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [54]:
# split
print(df['Name'].str.split(','))
print(df['Name'].str.split(',').str.get(0))

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: Name, Length: 891, dtype: object
0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

In [4]:
df['Last Name'] = df['Name'].str.split(',').str.get(0)
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings

In [5]:
df[['Title','First Name']] = df['Name'].str.split(',').str.get(1).str.strip().str.split(' ', n=1, expand=True)
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,Title,First Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr.,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs.,John Bradley (Florence Briggs Thayer)

In [62]:
df['Title'].value_counts()

Title
Mr.          517
Miss.        182
Mrs.         125
Master.       40
Dr.            7
Rev.           6
Mlle.          2
Major.         2
Col.           2
the            1
Capt.          1
Ms.            1
Sir.           1
Lady.          1
Mme.           1
Don.           1
Jonkheer.      1
Name: count, dtype: int64

In [6]:
# replace 

df['Title'] = df['Title'].str.replace('Ms.','Miss.')
df['Title'] = df['Title'].str.replace('Mlle.','Miss.')
df['Title'].value_counts()

Title
Mr.          517
Miss.        185
Mrs.         125
Master.       40
Dr.            7
Rev.           6
Major.         2
Col.           2
Don.           1
Mme.           1
Lady.          1
Sir.           1
Capt.          1
the            1
Jonkheer.      1
Name: count, dtype: int64

In [7]:
# startswith endswith

df[df['First Name'].str.startswith('A')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,Title,First Name
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,Andersson,Mr.,Anders Johan
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q,McGowan,Miss.,"Anna ""Annie"""
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S,Holverson,Mr.,Alexander Oskar
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.0000,NaN,S,Vander Planke,Miss.,Augusta Maria
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN,Icard,Miss.,Amelie
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
842,843,1,1,"Serepeca, Miss. Augusta",female,30.0,0,0,113798,31.0000,NaN,C,Serepeca,Miss.,Augusta
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S,Abbing,Mr.,Anthony
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C,Duran y More,Miss.,Asuncion
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C,Najib,Miss.,"Adele Kiamie ""Jane"""
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S,Gustafsson,Mr.,Alfred Ossian

In [8]:
# isalpha isdigit

df[df['First Name'].str.isdigit()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Last Name, Title, First Name]
Index: []

In [11]:
# Serach john name lower uppar kuch bhi ho
df[df['First Name'].str.contains('john', case=False)].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,Title,First Name
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs.,John Bradley (Florence Briggs Thayer)
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,11668,21.0000,NaN,S,Turpin,Mrs.,William John Robert (Dorothy Ann Wonnacott)
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S,Rogers,Mr.,William John

In [14]:
# Find Last Name with start and end with vowels

df[df['Last Name'].str.contains('^[aeiouAEIOU].+[aeiouAeiou]$')].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,Title,First Name
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C,Uruchurtu,Don.,Manuel E
49,50,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.0,1,0,349237,17.8000,NaN,S,Arnold-Franchi,Mrs.,Josef (Josefine Franchi)
207,208,1,3,"Albimona, Mr. Nassef Cassem",male,26.0,0,0,2699,18.7875,NaN,C,Albimona,Mr.,Nassef Cassem

In [15]:
# Slicing

df['First Name'].str[:4]

0      Owen
1      John
2      Lain
3      Jacq
4      Will
       ...
886    Juoz
887    Marg
888    Cath
889    Karl
890    Patr
Name: First Name, Length: 891, dtype: object

## Data and Time

### TimeStamp

In [22]:
# TimeStamp Object
pd.Timestamp('2025/7/24')

Timestamp('2025-07-24 00:00:00')

In [19]:
# Variations
pd.Timestamp('2025-7-24')

Timestamp('2025-07-24 00:00:00')

In [21]:
pd.Timestamp('2025, 7, 24')

Timestamp('2025-07-24 00:00:00')

In [23]:
# only Year
pd.Timestamp('2025')

Timestamp('2025-01-01 00:00:00')

In [24]:
# using text
pd.Timestamp('7th July 2025')

Timestamp('2025-07-07 00:00:00')

In [26]:
# Providing Time
pd.Timestamp('7th July 2025 2:41AM')

Timestamp('2025-07-07 14:41:00')

In [27]:
# python,  using datetime.datetime object

import datetime as dt
dt.datetime(2025,1,24,2,44,45)

datetime.datetime(2025, 1, 24, 2, 44, 45)

In [29]:
# convert datatime to timestamp
x = pd.Timestamp(dt.datetime(2025,1,24,2,44,45))
x

Timestamp('2025-01-24 02:44:45')

In [30]:
# fetching Atrributes
print(x.year)
print(x.month)
print(x.day)
print(x.hour)
print(x.minute)
print(x.second)

2025
1
24
2
44
45

### DateTimeIndex

In [34]:
# DateTimeIndex Object
pd.DatetimeIndex(['2023-05-17', '2024-12-01', '2025-07-23'])

DatetimeIndex(['2023-05-17', '2024-12-01', '2025-07-23'], dtype='datetime64[ns]', freq=None)

In [35]:
# using python datetime object
pd.DatetimeIndex([dt.datetime(2025,1,24), dt.datetime(2025,2,25), dt.datetime(2025,3,26)])

DatetimeIndex(['2025-01-24', '2025-02-25', '2025-03-26'], dtype='datetime64[ns]', freq=None)

In [39]:
# using Timestamp

dt_index = pd.DatetimeIndex([pd.Timestamp(2025,1,24), pd.Timestamp(2025,2,25), pd.Timestamp(2025,3,26)])
dt_index

DatetimeIndex(['2025-01-24', '2025-02-25', '2025-03-26'], dtype='datetime64[ns]', freq=None)

In [40]:
# using datatime index as series index
pd.Series([1,2,3], index= dt_index)

2025-01-24    1
2025-02-25    2
2025-03-26    3
dtype: int64

### Daterange Function

In [41]:
# freq me d 2d 3d 
pd.date_range(start='2025/7/24', end='2025/7/30', freq='D')

DatetimeIndex(['2025-07-24', '2025-07-25', '2025-07-26', '2025-07-27',
               '2025-07-28', '2025-07-29', '2025-07-30'],
              dtype='datetime64[ns]', freq='D')

In [42]:
# Business Days

pd.date_range(start='2025/7/24', end='2025/7/30', freq='B')

DatetimeIndex(['2025-07-24', '2025-07-25', '2025-07-28', '2025-07-29',
               '2025-07-30'],
              dtype='datetime64[ns]', freq='B')

In [44]:
# W one week per day

pd.date_range(start='2025/7/24', end='2025/7/30', freq='W-THU')

DatetimeIndex(['2025-07-24'], dtype='datetime64[ns]', freq='W-THU')

In [46]:
# hourly dates
# freq me kitne hours ke space se chahiye 2h 3h

pd.date_range(start='2025/7/24', end='2025/7/30', freq='h')

DatetimeIndex(['2025-07-24 00:00:00', '2025-07-24 01:00:00',
               '2025-07-24 02:00:00', '2025-07-24 03:00:00',
               '2025-07-24 04:00:00', '2025-07-24 05:00:00',
               '2025-07-24 06:00:00', '2025-07-24 07:00:00',
               '2025-07-24 08:00:00', '2025-07-24 09:00:00',
               ...
               '2025-07-29 15:00:00', '2025-07-29 16:00:00',
               '2025-07-29 17:00:00', '2025-07-29 18:00:00',
               '2025-07-29 19:00:00', '2025-07-29 20:00:00',
               '2025-07-29 21:00:00', '2025-07-29 22:00:00',
               '2025-07-29 23:00:00', '2025-07-30 00:00:00'],
              dtype='datetime64[ns]', length=145, freq='h')

In [48]:
# Month End
pd.date_range(start='2025/7/24', end='2025/10/30', freq='ME')

DatetimeIndex(['2025-07-31', '2025-08-31', '2025-09-30'], dtype='datetime64[ns]', freq='ME')

In [49]:
# Month Start
pd.date_range(start='2025/7/24', end='2025/10/30', freq='MS')

DatetimeIndex(['2025-08-01', '2025-09-01', '2025-10-01'], dtype='datetime64[ns]', freq='MS')

In [51]:
# Year End
pd.date_range(start='2025/7/24', end='2030/10/30', freq='YE')

DatetimeIndex(['2025-12-31', '2026-12-31', '2027-12-31', '2028-12-31',
               '2029-12-31'],
              dtype='datetime64[ns]', freq='YE-DEC')

In [53]:
# Using Periods

pd.date_range(start='2025/7/24',periods=25, freq='D')

DatetimeIndex(['2025-07-24', '2025-07-25', '2025-07-26', '2025-07-27',
               '2025-07-28', '2025-07-29', '2025-07-30', '2025-07-31',
               '2025-08-01', '2025-08-02', '2025-08-03', '2025-08-04',
               '2025-08-05', '2025-08-06', '2025-08-07', '2025-08-08',
               '2025-08-09', '2025-08-10', '2025-08-11', '2025-08-12',
               '2025-08-13', '2025-08-14', '2025-08-15', '2025-08-16',
               '2025-08-17'],
              dtype='datetime64[ns]', freq='D')

## to_datetime Function

In [60]:
# Series Example

s = pd.Series(['2023-05-17', '2024-12-01', '2025-07-23'])
pd.to_datetime(s).dt.month_name()

0         May
1    December
2        July
dtype: object

In [62]:
s = pd.Series(['2023-05-17', '2024-120-01', '2025-07-23'])
pd.to_datetime(s, errors='coerce')

0   2023-05-17
1          NaT
2   2025-07-23
dtype: datetime64[ns]

In [63]:
df = pd.read_csv('expense_data.csv')
df.head(3)

,Date,Account,Category,Subcategory,Note,INR,Income/Expense,Note.1,Amount,Currency,Account.1
0,3/2/2022 10:11,CUB - online payment,Food,NaN,Brownie,50.0,Expense,NaN,50.0,INR,50.0
1,3/2/2022 10:11,CUB - online payment,Other,NaN,To lended people,300.0,Expense,NaN,300.0,INR,300.0
2,3/1/2022 19:50,CUB - online payment,Food,NaN,Dinner,78.0,Expense,NaN,78.0,INR,78.0

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            277 non-null    object
 1   Account         277 non-null    object
 2   Category        277 non-null    object
 3   Subcategory     0 non-null      float64
 4   Note            273 non-null    object
 5   INR             277 non-null    float64
 6   Income/Expense  277 non-null    object
 7   Note.1          0 non-null      float64
 8   Amount          277 non-null    float64
 9   Currency        277 non-null    object
 10  Account.1       277 non-null    float64
dtypes: float64(5), object(6)
memory usage: 23.9+ KB

In [67]:
df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            277 non-null    datetime64[ns]
 1   Account         277 non-null    object
 2   Category        277 non-null    object
 3   Subcategory     0 non-null      float64
 4   Note            273 non-null    object
 5   INR             277 non-null    float64
 6   Income/Expense  277 non-null    object
 7   Note.1          0 non-null      float64
 8   Amount          277 non-null    float64
 9   Currency        277 non-null    object
 10  Account.1       277 non-null    float64
dtypes: datetime64[ns](1), float64(5), object(5)
memory usage: 23.9+ KB